puppeteer.local.yaml
config:
  target: "http://localhost:3000"
  plugins:
    expect: {}
  #http:
    #timeout: 30
  phases:
    - duration: 50
      arrivalRate: 1
  processor: "./scenario.js"
scenarios:
  - flow:
      #- function: "setupQueryThings"
      #- function: "setupQueryPlaces"
      - function: "setupQueryMedias"
      #- function: "setupQueryRequest"
      - post:
          url: "{{medias}}"
          #json:
            #body: "{{setupQueryMedias}}"
         # expect:
          #  - statusCode: 200
           # - contentType: application/json; charset=utf-8
        afterResponse: "afterResponse"