scenario.yaml
config:
  target: "http://104.155.72.120/dollar-street"
  plugins:
    expect: {}
  #http:
    #timeout: 30
  phases:
    - duration: 100
      arrivalRate: 20
  processor: "./scenario.js"
scenarios:
  - flow:
    # Call setupSomeData
    - function: "setupQuery"
    - get:
        headers:
          Referer: "http://104.155.72.120/dollar-street/matrix"
        url: "/v1/save-pinned-places?resolution=480x480&places={{ query }}"
        capture:
          - json: "$.success"
            as: success
        expect:
          - statusCode: 200
          - contentType: json
          - hasProperty: success
          - equals:
            - "true"
        afterResponse: "afterResponse"